In [5]:
# Conditional Selection
# Comparison Operator with the whole DataFrame and with a Column
# Dealing with more than one condition
# Re-Setting Index
# Setting Index based off of an existing column
# Silly Moments

In [50]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [51]:
boob = pd.DataFrame(randn(5,3),[1,2,3,4,5], ['A','B','C'])
boob

          A         B         C
1  2.706850  0.628133  0.907969
2  0.503826  0.651118 -0.319318
3 -0.848077  0.605965 -2.018168
4  0.740122  0.528813 -0.589001
5  0.188695 -0.758872 -0.933237

In [52]:
boob > 0

       A      B      C
1   True   True   True
2   True   True  False
3  False   True  False
4   True   True  False
5   True  False  False

In [53]:
boob[boob > 0]

          A         B         C
1  2.706850  0.628133  0.907969
2  0.503826  0.651118       NaN
3       NaN  0.605965       NaN
4  0.740122  0.528813       NaN
5  0.188695       NaN       NaN

In [54]:
boob['B']> 0

1     True
2     True
3     True
4     True
5    False
Name: B, dtype: bool

In [55]:
boob[boob['B'] > 0]

          A         B         C
1  2.706850  0.628133  0.907969
2  0.503826  0.651118 -0.319318
3 -0.848077  0.605965 -2.018168
4  0.740122  0.528813 -0.589001

In [56]:
boob[boob > 0]['B']

1    0.628133
2    0.651118
3    0.605965
4    0.528813
5         NaN
Name: B, dtype: float64

In [57]:
boob[boob > 0][['C', 'B']]

          C         B
1  0.907969  0.628133
2       NaN  0.651118
3       NaN  0.605965
4       NaN  0.528813
5       NaN       NaN

In [59]:
# Multiple Conditions
boob[(boob['B'] > 0) & (boob['A'] < 1)]

          A         B         C
2  0.503826  0.651118 -0.319318
3 -0.848077  0.605965 -2.018168
4  0.740122  0.528813 -0.589001

In [60]:
boob[(boob['B'] > 0) | (boob['A'] < 1)]

          A         B         C
1  2.706850  0.628133  0.907969
2  0.503826  0.651118 -0.319318
3 -0.848077  0.605965 -2.018168
4  0.740122  0.528813 -0.589001
5  0.188695 -0.758872 -0.933237

In [61]:
boob.reset_index()

   index         A         B         C
0      1  2.706850  0.628133  0.907969
1      2  0.503826  0.651118 -0.319318
2      3 -0.848077  0.605965 -2.018168
3      4  0.740122  0.528813 -0.589001
4      5  0.188695 -0.758872 -0.933237

In [62]:
boob.set_index('C')

                  A         B
C
 0.907969  2.706850  0.628133
-0.319318  0.503826  0.651118
-2.018168 -0.848077  0.605965
-0.589001  0.740122  0.528813
-0.933237  0.188695 -0.758872

In [63]:
# silly moments
Shanas = [['Sabi_Geh', 'Abdulateef', 'Rehige'],
          ['BOLU', 'Reserve', 'Olamileken'],
          ['A-Y', 'Ifedayo', 'Josh']]
AGBA_DEVS = pd.DataFrame(Shanas, columns=['FUAD', 'IRE', 'MOFE'])
AGBA_DEVS

       FUAD         IRE        MOFE
0  Sabi_Geh  Abdulateef      Rehige
1      BOLU     Reserve  Olamileken
2       A-Y     Ifedayo        Josh

In [64]:
AGBA_DEVS >= 'BOLU'

    FUAD    IRE  MOFE
0   True  False  True
1   True   True  True
2  False   True  True

In [65]:
AGBA_DEVS[AGBA_DEVS >= 'BOLU']

       FUAD      IRE        MOFE
0  Sabi_Geh      NaN      Rehige
1      BOLU  Reserve  Olamileken
2       NaN  Ifedayo        Josh

In [ ]:
'FUAD' >= 'BOLU'